Autodesk.Revit.DB.ExportPDFSettings.SetOptions(Autodesk.Revit.DB.PDFExportOptions)
Sets options for exporting.
options:
Other options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExportPDFSettings.GetOptions
Gets a copy of options from settings for exporting.
Modification on this options would not change the element.
Remarks:
Since the PDFExportOptions.FileName is not serialized, when Combine
is true (which means all the views would be exported into one PDF file, whose
file name is specified by PDFExportOptions.FileName), the returned Autodesk.Revit.DB.PDFExportOptions
would have PDFExportOptions.FileName as an empty string. The user has to
set the PDFExportOptions.FileName before calling the Document.Export(string, IList{ElementId}, PDFExportOption)
API exporting a "combined" PDF file.
Returns:
The options.
Since:
2022

Autodesk.Revit.DB.ExportPDFSettings.GetActivePredefinedSettings(Autodesk.Revit.DB.Document)
Gets the active settings element in the document.
document:
The document to find the active settings.
Returns:
The active settings, or nullptr if none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExportPDFSettings.FindByName(Autodesk.Revit.DB.Document,System.String)
Returns settings element by name.
document:
The document to find the settings with the specified name.
name:
Name of the settings to find.
Returns:
The settings element, or nullptr if not found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExportPDFSettings.IsValidName(Autodesk.Revit.DB.Document,System.String)
Returns result that the proposed name is valid and not exist in the specified document.
Remarks:
Name can't contains following characters, such as { } [ ] | ; < > ? ` ~ \ : \r \n \f \t \v.
Name can't be blank.
If true, the name is valid and not exist in specified document.
If false, the name is not a valid name which means it does not exist in specified document.
document:
Document to check
name:
Name to check.
Returns:
Whether or not the name is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExportPDFSettings.ListNames(Autodesk.Revit.DB.Document)
Returns all the names of the settings instances in the document.
document:
Document where the settings to be found.
Returns:
List of names.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExportPDFSettings.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.PDFExportOptions)
Returns an new created ExportPDFSettings element in the document with specified settings.
document:
Document where the settings will be created.
name:
Name to the settings.
options:
The options to be set.
Returns:
New instance of ExportPDFSettings just created in the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
Setting name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.ExportPDFSettings
Settings for PDF export
Since:
2022